package com.saxisdzvali.toko.listview;

/**
 * Created by ToKo on 12/7/2016.
 */

public class Mwerlebi {
    public static String[] names = new String[] { "მირზა გელოვანი", "ნოდარ დუმბაძე", "ილია ჭავჭავაძე", "სულხან-საბა ორბელიანი", "გალაკტიონ ტაბიძე", "მიხეილ ჯავახიშვილი" };


    public static String [] descriptions = new String [] {

            "მირზა (რევაზ) გედეონის ძე გელოვანი დაიბადა 1917 წლის 2 მარტს სოფელ ნაქალაქარში (ახლანდელი თიანეთის მუნიციპალიტეტი). 1936-1939 წლებში ცხოვრობდა თბილისში, თავისუფალ მსმენელად დადიოდა უნივერსიტეტში. მუშაობდა გამომცემლობა „ფედერაციაში“, „საბჭოთა აფხაზეთის“ რედაქციაში. მისი ლექსები 1935 წლიდან იბეჭდებოდა ჟურნალში „ჩვენი თაობა“ და სხვა ჟურნალ-გაზეთებში. 1939 წელს წითელ არმიაში გაიწვიეს. მირზა გელოვანი იმ ახალგაზრდა პოეტთა თაობას ეკუთვნოდა, რომელმაც თვითმყოფადი, ხალასი და ალალ-მართალი ლექსებით თავისებური ხიბლი შემატეს თბილისის ლიტერატურულ ცხოვრებას. მირზა გელოვანმა შექმნა თავისთავადი პოეტური სამყარო. მისი ლექსები (განსაკუთრებით სამიჯნურო) გამოირჩევა ნათელი სახეებით, ლაკონიზმით, ემოციურობითა და ექსპრესიულობით. აღიარება მოუტანეს ლექსებმა: „თუშის ქალი წყაროზე“, „ცხრაკარა“, „შავლეგო“, „მელოდე“, „მთაწმინდიდან სმოლენსკამდე“, „იჯექი წყნარად“, „მთვარე“, „შემოღამება საბადურზე“, „მახსოვს“, „ხრეშად დაცვივდა სიტყვები“; ასევე აღსანიშნავია ბალადა „აონი“, პოემა „შავნაბადა“ და სხვა. მირზა გელოვანმა სულ სამიოდე წელი იტრიალა დედაქალაქის ლიტერატურულ წრეებში, ხოლო შემდეგ, ომში წასული პოეტი, დროდადრო სამშობლოში აგზავნიდა ნაჩქარევად დაწერილ ლექსებსა და წერილებს, რომლებშიც თბილისის მონატრება ჩანდა:\n" +
                    "\n" +
                    "“წუხელ ვებრძოდი ცეცხლს და ურაგანს\n" +
                    "\n" +
                    "და საშინელი ბრძოლების ნისლში\n" +
                    "\n" +
                    "მე მომეჩვენა, სადღაც, ჩემს უკან\n" +
                    "\n" +
                    "აელვებული იდგა თბილისი”.\n" +
                    "\n" +
                    "გამოცემულია მისი ლექსების კრებულები: „ლექსები“ (1954), „შავნაბადა“ (1956), „ცხრაკარა“ (1960), „უბის წიგნაკიდან“ (1964), „თეთრი მიწა“ (1972), „ფრონტული ლექსები“ (1975).\n" +
                    "\n" +
                    "მირზა გელოვანს სიკვდილის შემდეგ მიენიჭა საქართველოს კომკავშირის პრემია (1973). თბილისში, ვაჟა-ფშაველას პროსპექტზე, არის მირზა გელოვანის სახელობის ბიბლიოთეკა. თელეთში, თბილისის მახლობლად, დგას მისი ძეგლი.\n" +
                    "\n" +
                    "მირზა გელოვანი გარდაიცვალა ომის მიწურულს, 1944 წლის ივლისში, როდესაც უკანგაქცეულ მტერს დადევნებული დასავლეთ დვინის სამდინარო დაბრკოლებაზე გადადიოდა. დაკრძალულია ბელარუსში, ვიტებსკის ოლქის ბერენკოვიჩის რაიონის სოფელ სანიკის საძმო სასაფლაოზ",

            "ნოდარ დუმბაძე დაიბადა 1928 წლის 14 ივლისს ქალაქ თბილისში, მოსამსახურის ოჯახში. მამა — ვლადიმერ ივანეს ძე დუმბაძე საქართველოს კომუნისტური პარტიის მაიაკოვსკის რაიონული კომიტეტის პირველი მდივანი, დედა — ანა ივანეს ასული ბახტაძე — დიასახლისი. 1937 წლის რეპრესიების პერიოდში მამამისი დააპატიმრეს, ხოლო დედა გადაასახლეს. ნოდარი თავდაპირველად სწავლობდა თბილისის მე-15 საშუალო სკოლაში, რომელიც არ დაუმთავრებია, რადგან საცხოვრებლად ბებიასა და ბაბუასთან, ჩოხატაურის რაიონის სოფელ ზენობანში გადავიდა.\n" +
                    "\n" +
                    "1945 წელს ნოდარ დუმბაძემ დაასრულა ჩოხატაურის რაიონის სოფელ ხიდისთავის საშუალო სკოლა და თბილისში დაბრუნდა სწავლის გასაგრძელებლად. შევიდა თბილისის სახელმწიფო უნივერსიტეტის ეკონომიკურ ფაკულტეტზე, რომელიც 1950 წელს დაამთავრა. ეკონომიკური ფაკულტეტის დამთავრების შემდეგ იგი ასისტენტად მუშაობდა უნივერსიტეტის ლაბორატორიაში, იმავდროულად ეწეოდა შემოქმედებით მოღვაწეობას. 1956—1957 წლებში მან გამოსცა იუმორისტული მოთხრობების სამი კრებული. 1957 წელს სამსახური მიატოვა, რათა მთელი დრო მწერლობისათვის მიეძღვნა. სხვადასხვა ჟურნალთან თანამშრომლობის პარალელურად დუმბაძე კინოსცენარებსაც წერდა. იმავდროულად იბეჭდებოდა მისი იუმორისტული მოთხრობებიც.\n" +
                    "\n" +
                    "1967—1972 წლებში იყო ჟურნალ „ნიანგის“ რედაქტორი. 1972 წლიდან საქართველოს მწერალთა კავშირის გამგეობის მდივანი და სსრკ-ის მწერალთა კავშირის გამგეობის წევრი. ჟურნალის „მოლოდაია გვარდია“ სარედაქციო კოლეგიის წევრი.\n" +
                    "\n" +
                    "გარდაიცვალა 1984 წელს. თავდაპირველად დაკრძალული იყო ქალაქ თბილისში, საბავშვო ქალაქ „მზიურში“, რომლის აშენების იდეა თავად ეკუთვნოდა, ხოლო 2009 წლის 14 სექტემბერს მისი ნეშტი მთაწმინდის მწერალთა და საზოგადო მოღვაწეთა პანთეონში გადაასვენეს",

            "ილია ჭავჭავაძე დაიბადა გადამდგარი ოფიცრის, თავად გრიგოლ ჭავჭავაძის ოჯახში. 10 წლისას გარდაეცვალა დედა — მარიამ ბებურიშვილი, 15 წლისას — მამა. დაობლებული ილიასა და მისი და-ძმების მოვლა-პატრონობა მამიდამ, მაკრინე ჭავჭავაძე-ერისთავისამ, იტვირთა.",

            "სულხან-საბა ორბელიანი 1658 წელს სოფელ ტანძიაში დაიბადა. შთამომავლობით დიდგვაროვანი ფეოდალი იყო. მამა — ვახტანგი, ქართლის სამეფოს მდივანბეგი იყო; დედა — თამარი ზაალ არაგვის ერისთავის ასული. სამეფო კარზე, რომელიც კულტურისა და განათლების ცენტრსაც წარმოადგენდა, ორბელიანი მეგობრობდა უფროს მამიდაშვილებთან, ვახტანგ V-ის (შაჰ-ნავაზის) განათლებულ ვაჟებთან: არჩილთან, ლევანთან, გიორგისთან (შემდეგში ქართლის მეფე გიორგი XI). ამ უკანასკნელს თავის სულიერ მოძღვრად მიიჩნევდა. მიიღო კარგი განათლება როგორც საერო, ისე სასულიერო დისციპლინებში. შემდეგში სამეფო კარზე მასვე დაევალა მომავალი ტახტის მემკვიდრის ვახტანგ ლევანის ძის (ვახტანგ VI) აღზრდა.\n" +
                    "\n" +
                    "ორბელიანი ჭაბუკობიდანვე ჩაება სახელმწიფოებრივ, სამწერლო და სამეცნიერო საქმიანობაში. იყო ირან-ოსმალეთის აგრესიის წინააღმდეგ გაჩაღებული ბრძოლის ერთ-ერთი თავკაცი და გიორგი XI-ისა და, მოგვიანებით, ვახტანგ VI-ის ახალი პოლიტიკური ორიენტაციათა ძიების ერთგული თანამდგომი. 1688 წელს, როცა ირანის შაჰმა გიორგი XI-ს მეფობა ჩამოართვა, რეპრესირებული ორბელიანი იძულებული გახდა გასცლოდა ქართლს. ერთხანს იმერეთში, შემდეგ სამცხეში იმყოფებოდა. 1698 წელის 18 მარტს, როგორც ჩანს, პოლიტიკური მიზეზთა გამო, საბას სახელით ბერად აღიკვეცა დავითგარეჯის იოანე ნათლისმცემლის მონასტერში. 1703 წლიდან, ქართლის ახალი გამგებლის ვახტანგ VI-ის დავალებით, ორბელიანმა დიპლომატიური მისიით იმოგზაურა სხვადასხვა ქვეყანაში, მათ შორის საფრანგეთსა და იტალიაში (1713-1716). 1710 წლის 1 დეკემბრიდან - 1711 წლის 20 თებერვლამდე იმყოფებოდა ხვარასანში, ქაიხოსრო მეფესთან. სამშობლოში დაბრუნდა 1711 წლის 11 მაისს. 1712 წლის 23 აპრილიდან - 2 ნოემბრამდე ვახტანგ მეფესთან ერთად ისპაჰანში იმყოფებოდა. სამშობლოში დაბრუნდა 20 დეკემბერს. 1713 წლის 17 აგვისტოს საფრანგეთში „გაიპარა“, მოიარა პარიზი, ჟენევა, სიცილია და რომი. შეხვდა რომის პაპს კრანდუკს. უკან მობრუნებულს რომის პაპმა წმინდა ჯვრის ნაწილი, წმინდა კლემენტოს თავი და და სხვა მრავალი ნაწილი უბოძა. 1715 წლის 19 იანვარს კონსტანტინოპოლში ჩავიდა, სადაც შეუდგა „ლექსიკონის“ წერას, რომელიც 1716 წლის 20 იანვარს დაასრულა.\n" +
                    "\n" +
                    "გარკვეული პოლიტიკური მოსაზრებებით ორბელიანმა მიიღო კათოლიკური აღმსარებლობა. ირან-ოსმალეთის მუდმივი აგრესიისაგან განაწამებ ქართველ სახელმწიფო მოღვაწეებს, მათ შორის ორბელიანს სურდათ მოესინჯათ ნიადაგი დასავლეთ ევროპასთან პოლიტიკური კავშირისათვის. ორბელიანი ეწვია საფრანგეთის მეფეს ლუი XIV-ს და რომის პაპს კლიმენტი XI-ს, რათა ეთხოვა აგრეთვე ფინანსური დახმარება ირანის ტყვეობიდან ვახტანგ VI-ის გამოსახსნელად. მისი დიპლომატიური მისია მარცხით დამთავრდა. იმედგაცრუებულმა ორბელიანმა დიდი გაჭირვებით ჩამოაღწია სამშობლოში. ბერის სამოსით შემოსილი ეძებდა გზებს ქვეყნის ოსმალეთისგან გასანთავისუფლებლად (სულხანი 1698 წელს ბერად აღიკვეცა დავითგარეჯის მონასტერში. ამ დროიდან იწოდება იგი სულხან-საბად).\n" +
                    "\n" +
                    "1724 წელს, როცა ვახტანგ VI-მ რუსეთს დააპირა გადახვეწა, მან მოსკოვში წინასწარი მოლაპარაკებისათვის ორბელიანი გაგზავნა, მაგრამ ხანდაზმულ მწერალს არ დასცალდა უკანასკნელი მისიის აღსრულება, იგი მოსკოვში მალე გარდაიცვალა. დაკრძალეს ვსესვიატსკოეში.[1][2]",

            "გალაკტიონ ტაბიძე დაიბადა ვანთან ახლოს სოფელ ჭყვიშში. პოეტის მამა - ვასილ ტაბიძე, შვილის დაბადებამდე ორი თვით ადრე გარდაიცვალა. იგი ჯერ სოფლის მღვდელი, შემდეგ კი იმავე სოფლის მასწავლებელი იყო. 1900 წელს ტაბიძე ჩაირიცხა ქუთაისის სასულიერო სასწავლებელში. 1908 წლიდან სწავლა განაგრძო თბილისის სასულიერო სემინარიაში. 1910–1911 წლებში მუშაობდა მასწავლებლად. 1917–1918 წლებში იმყოფებოდა მოსკოვსა და პეტროგრადში. 1914 წელს გამოდის გალაკტიონ ტაბიძის ლექსების პირველი კრებული, რომელმაც ერთბაშად მიიპყრო საზოგადოების ყურადღება და დიდი პოპულარობა მოიპოვა, ხოლო 1919 წელს გამოცემულმა \"არტისტულმა ყვავილებმა\" ავტორს \"გენიალური გალაკტიონისა\" და \"პოეტების მეფის\" სახელი მოუტანეს. 1919 წლიდან ცხოვრობდა და მოღვაწეობდა თბილისში. 1922-1923 წლებში გამოსცემდა \"გალაკტიონ ტაბიძის ჟურნალს\". 1924 წელს იგი იყო ჟურნალ \"მნათობის\" ერთ-ერთი ფუძემდებელი. 1935 წელს პარიზში მონაწილეობდა ანტიფაშისტურ კონგრესში.\n" +
                    "\n" +
                    "უდიდესი პოპულარობისა და თაყვანისცემის მიუხედავად, პოეტმა სიცოცხლე სულიერ სიმარტოვეში განვლო. ამან გარკვეული კვალი დაამჩნია მის შემოქმედებასაც, რომელმაც პოეზიას ახალი სიცოცხლე, განსხვავებული რიტმი, მრავალფეროვნება და საოცარი მოქნილობა შესძინა.\n" +
                    "\n" +
                    "გალაკტიონი გარდაიცვალა 1959 წლის 17 მარტს. მან სიცოცხლე თვითმკვლელობით დაასრულა.",

            "მიხეილ საბას ძე ჯავახიშვილი (ნამდვილი გვარი ადამაშვილი) (დ. 8 ნოემბერი/20 ნოემბერი, 1880, სოფ. წერაქვი, მარნეულის რაიონი — გ. 30 სექტემბერი, 1937) — ქართველი მწერალი, იყო თვალსაჩინო საზოგადო და პოლიტიკური მოღვაწე, 1921—1924 წლების ეროვნულ-განმათავისუფლებელი მოძრაობის ერთ-ერთი ლიდერი. მისი პირველი მოთხრობა 1903 წელს გამოჩნდა, თუმცა შემდეგი ნაწარმოები მხოლოდ 1920-იან წლებში გამოაქვეყნა. წინააღმდეგობა საბჭოთა იდეოლოგიის ზეწოლასთან მწერალს სიცოცხლის ფასად დაუჯდა: ის სტალინის პერიოდის დიდი წმენდის მსხვერპლი გახდა, ხოლო მისი ნაწარმოებები აკრძალული იყო თითქმის ორი ათწლეულის განმავლობაში. თანამედროვე ბრიტანელი რუსულისა და ქართულის ლიტარატურათმცოდნე დონალდ რეიფილდი ჯავახიშვილის თხრობის სტილს, იუმორს, ფარულ ირონიასა და მორალურ შემართებას სტენდალის, მოპასანისა და ზოლას თვისებებს ადარებს. მისი თქმით „თანამედროვე ქართულ პროზაში მხოლოდ კონსტანტინე გამსახურდიას შეეძლო მსგავსი საერთაშორისო აღიარების დონის მიღწევა“.[1]"


    };
public static String [] images = new String[]{
        "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Mirza_Gelovani.jpg/250px-Mirza_Gelovani.jpg",
        "https://upload.wikimedia.org/wikipedia/ka/thumb/2/2e/Nodar_Dumbadze.jpg/200px-Nodar_Dumbadze.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Iliachavchavadze.jpg/250px-Iliachavchavadze.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/%E1%83%A1%E1%83%A3%E1%83%9A%E1%83%AE%E1%83%90%E1%83%9C-%E1%83%A1%E1%83%90%E1%83%91%E1%83%90_%E1%83%9D%E1%83%A0%E1%83%91%E1%83%94%E1%83%9A%E1%83%98%E1%83%90%E1%83%9C%E1%83%98.jpg/270px-%E1%83%A1%E1%83%A3%E1%83%9A%E1%83%AE%E1%83%90%E1%83%9C-%E1%83%A1%E1%83%90%E1%83%91%E1%83%90_%E1%83%9D%E1%83%A0%E1%83%91%E1%83%94%E1%83%9A%E1%83%98%E1%83%90%E1%83%9C%E1%83%98.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Galaktioni_1933.jpg/250px-Galaktioni_1933.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/c/cf/Javahishvili.jpg"

};


}
